Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: མི་ལི་མི་ལི། ཊ་ཊ་ཊ་ཊ། ཋ་ཋ་ཋ་ཋ། ཊི་ཊི་ཊི་ཊི། ཊུ་ཊུ་ཊུ་ཊུ།
en: Mili mili, ṭaṭa ṭaṭa, ṭhaṭha ṭhaṭha, ṭiṭi ṭiṭi, ṭuṭu ṭuṭu!

source: ཨེ་ནེ་ཡ་ཙརྨྨ་ཀྲི་ཏ་པ་རི་ཀ་ར།
en: You who wear a tunic of antelope skin!

source: ཨེ་ཧྱེ་ཧི། ཨཱི་ཤྭ་ར་མ་ཧེ་ཤྭ་ར།
en: Come, come!

source: མ་ཧཱ་བྷཱུ་ཏ་ག་ཎ་སཾ་བྷཉྫ་ཀ །
en: You are the great lord who crushes the hordes of bhūtas!

source: ཀུ་རུ་ཀུ་རུ། པ་ར་པ་ར།
en: Act, act!

source: ཀ་ར་ཀ་ར། ཀ་ཊ་ཀ་ཊ། མ་ཊ་མ་ཊ། བི་ཤུད་དྷ། བི་ཥ་ཡ།
en: Para para, kara kara, kaṭa kaṭa, maṭa maṭa!

source: བཱ་སི་ན་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །
en: You abide in the pure domain, O great compassionate one!

source: ཤྭེ་ཏ་ཡ་ཛྙོ་པ་བཱི་ཏ། རཏྣ་མུ་ཀུ་ཊ།
en: You wear a white sacred thread and a diadem with a row of jewels—the diadem of omniscience atop your head.

source: མཱ་ལཱ་དྷ་ར།
en: The palms of your hands are adorned with marvelous lotuses.

source: སརྦ་ཛྙཱ་ཤི་ར།
en: Your meditative concentration, samādhi, and liberation are unshakable.

source: སི་ཀྲྀ་ཏ་མུ་ཀུ་ཊ།
en: You mature the mindstreams of many beings completely.

source: མ་ཧཱདྦྷཱུ་ཏ།
en: Purifier of all karmic obscurations!

source: ཀ་མ་ལཱ་ལྃ་ཀྲྀ་ཏ།
en: Deliverer from all illness!

source: ཀ་ར་དྷ་རཱ་ཡ།
en: Fulfiller of all wishes!

source: དྷྱཱ་ན་ས་མཱ་དྷི།
en: Comforter of all beings!

source: བི་མོ་ཀྵ། ཨ་པྲ་ཀྃ་བྱ།
en: Homage be to you!

source: བ་ཧུ་ས་ཏྭ་སནྟ་ཧི་པ་རི་པཱ་ཙ་ཀ །མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །སརྦ་ཀརྨ་ཨཱ་བ་ར་ཎ་བི་ཤོ་དྷ་ཀ་སརྦ་བྱཱ་དྷི་པ་རི་མོ་ཙ་ཀ །
en: Svāhā. “

source: སརྦ་ཨཱ་ཤཱ་པ་རི་པཱུ་ར་ཀ །སརྦ་སཏྭ་ས་མཱ་ཤྭཱ་ས་ན་ཀ་ར། ན་མོ་སྟུ་ཏེ་སྭཱ་ཧཱ། བཀླགས་པས་ལས་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: He who completes the recitation will accomplish his activities.

source: །དུས་གསུམ་དུ་བཟླས་བརྗོད་བགྱིས་ན། མཚམས་མེད་པ་ལྔ་བྱང་བར་འགྱུར་ཞིང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །མཚམས་བཅད་པ་ལ་ནི།
en: If he recites this mantra three times, he will purify the five acts of immediate retribution and every karmic obscuration. “

source: ཨ་ག་རུའི་བདུག་པའམ། ཐལ་བ་དང་། ཆབ་བམ། ཡུངས་ཀར་དང་། སེང་ལྡེང་གི་ཕུར་བུ་ལ་སོགས་པས་སོ།
en: One should delimit a sacred area using water infused with ashes of aloe incense, mustard seeds, and pegs made of cutch tree wood.

source: །རིམས་ཐམས་ཅད་ལ་ནི་སྐུད་པས་སོ། །ནད་ཐམས་ཅད་ལ་ནི་མར་རམ། འབྲུ་མར་རམ། ཆབ་ལ་བཟླས་བརྗོད་བགྱིས་ཏེ་གཏོར་བར་བགྱིའོ།
en: To cure any type of fever, one should use a thread, and for all other diseases use ghee, oil, or water, incanting them and then giving them to the patient.

source: །བྱད་དགྲོལ་བ་ལ་ནི་མཚོན་གྱིས་སོ། །ལྟོ་ན་བ་ལ་ནི་སྲུང་བའི་སྐུད་པས་སོ།
en: To destroy the kākhordas, one should use an incanted weapon, and for stomachache, a protection thread.

source: །དུག་བསད་པ་ལ་ནི་ས་འམ་ཆབ་ཀྱིས་སོ།
en: To neutralize poison, one should use water with fresh salt, clay, or just water.

source: །མིག་ནད་ལ་ནི་སྐུད་པ་དཀར་པོས་རྣ་བ་ལ་གདགས་པར་བགྱིའོ། །སོ་ན་བ་ལ་ནི་ཤིང་ཀ་ར་བཱི་རའི་སོ་ཤིང་གིས་སོ།
en: If one suffers from eye ailments, one should tie an incanted white thread around one’s ear. If one has a toothache, one should use an incanted tooth stick made from oleander wood. “

source: །མཚམས་བཅད་པ་ནི། ཚོན་སྣ་ལྔའི་སྐུད་པ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ཏེ། སེང་ལྡེང་གི་ཕུར་བུ་བཞི་ལ་བཅིངས་ནས། ཕྱོགས་བཞིར་གཟུགས་པར་བགྱིས་ན། མཚམས་ཆེན་པོ་བཅིང་བར་འགྱུར་རོ།
en: To delimit a large sacred area, one should incant a five-colored thread twenty-one times and tie it on the four pegs of cutch-tree wood nailed in the four corners.

source: །ཐམས་ཅད་སྲུང་བ་ལ་ནི་སྐུད་པའམ། ཆབ་བམ་ཐལ་བས་སོ།
en: Using thread, water, or ashes affords protection against anything.

source: །གདོན་ཐམས་ཅད་ལ་ནི་ཚོན་སྣ་ལྔའི་སྐུད་པས་སོ། །རིམས་ཐམས་ཅད་ལ་ནི་སྐུད་པ་དཀར་པོས་སོ། །གཡན་པ་དང་། ཁྱི་རྡོ་དང་། ལྷོག་པ་དང་།
en: For all types of epileptic seizures, one should use a five-colored thread; for all fevers, a white thread; and for all types of insects, ringworm, pus boils, and asthma attacks, a mixture of honey and black pepper.

source: མགྲིན་པ་འགགས་པ་ཐམས་ཅད་ལ་ནི་སྦྲང་རྩི་དང་། པི་པི་ལིང་སྲེས་པས་སོ། །མིག་ནད་ལ་ནི་དྲི་ཆུའམ། ཤིང་བལ་ཤའི་ཆུའམ། ཤིང་མངར་གྱི་ཆུས་སོ།
en: For eye ailments, one should use perfumed water, water with flame-of-the-forest, or water infused with licorice.

source: །རྣ་བའི་ནད་ལ་ནི་འབྲུ་མར་གྱིས་སོ།
en: For an earache one should use oil.

source: །འཐབ་པ་དང་། འཐབ་མོ་དང་། རྩོད་པར་འགྱེད་པ་དང་། སྐུར་པ་འདེབས་པ་ཐམས་ཅད་ལ་ནི་ཆབ་ལ་བཟླས་བརྗོད་བགྱིས་ཏེ། ཁ་བཤལ་བར་བགྱིའོ།
en: In the case of quarrels, disputes, discord, disagreements, or false accusations, one should incant water and rinse one’s mouth with it. “

source: །དཔུང་དང་ཡུལ་དང་རྒྱལ་སྲིད་དང་། ཡུལ་འཁོར་ཐམས་ཅད་བསྲུང་བ་ལ་ནི་བུམ་པ་གང་བ་གཞག་ལ་གོས་གཙང་མ་བགོས་པས་མཆོད་པ་རྒྱ་ཆེན་པོ་བགྱིས་ནས།
en: To protect a country, a kingdom, or a realm from an army, one should arrange ritual jars and, after donning clean white garments, offer a large pūjā.

source: བཀླག་པར་བགྱིས་ན་ཞི་བ་ཆེན་པོར་འགྱུར་རོ།
en: If one recites the Amoghapāśa mantra over them, there will be lasting peace.

source: །དེས་ཡང་ཆབ་ཀྱིས་གཏོར་བར་བགྱིས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་སྲུང་བ་བགྱིས་པར་འགྱུར་ལགས་སོ།
en: If one sprinkles them with incanted water, all beings will be protected.

source: །ཡམས་ཀྱི་ནད་དང་གནོད་པ་དང་འཚེ་བ་ཐམས་ཅད་ཞི་བར་བགྱིད་པ་དང་། གླགས་ལྟ་བ་རྣམས་ལ་ནི་ཙན་དན་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ཏེ། སྙིང་གར་བྱུག་པར་བགྱིའོ།
en: All misfortunes and calamities will cease for those afflicted by them if they smear on their chest sandalwood paste incanted twenty-one times.

source: །མཚམས་མེད་པའི་ལས་ཐམས་ཅད་བས་པར་བགྱི་བ་ནི། རྟག་ཏུ་བཟླས་བརྗོད་ཀྱིས་སོ།
en: The karma of all the acts of immediate retribution will be purified if one recites the mantra continually.

source: །ཁྱིམ་བསྲུང་བ་ལ་ནི་པདྨའི་སྦྱིན་སྲེག་གིས་སོ།
en: A homa of lotuses will ensure the protection of the house.

source: །སེམས་ཅན་ཐམས་ཅད་བསྐྱང་བ་དང་། འབྱུང་པོའི་འཇིགས་པ་དང་། གདོན་ཐམས་ཅད་བསྲུང་བ་ལ་ནི་ཙན་དན་གྱི་སྦྱིན་སྲེག་གིས་སོ། །ཛ་ཡ་དང་བི་ཛ་ཡ་དང་། ན་ཀུ་ལི་དང་། གྷན་དྷཱ་ན་གུ་ལི་དང་། བ་རུ་ནི་དང་། ཙཻ་གྲ་བ་རུ་ཎི་དང་། ཨ་བྷ་ཡ་བ་ནི་དང་། ཨིན་དྲ་བ་ནི་དང་། གྷན་དྷ་པྲི་ཡང་ཀུ་དང་། རྒྱ་སྤོས་དང་། ཙ་ཀྲ་དང་། མ་ཧཱ་ཙ་ཀྲ་དང་། བིཥྞུ་ཀྲཱན་ཏ་དང་། སོ་མ་ར་ཛི་དང་།
en: A homa of sandalwood will ensure a means of livelihood for all beings and protect them against all bhūtas and grahas. “

source: སུ་ནན་ད་རྣམས་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ། ནོར་བུར་བགྱིས་ནས་སྤྱི་བོ་འམ། དཔུང་པ་ལ་བཏགས་པས་བསྲེལ་བར་བགྱིའོ། །ཁྱེའུ་རྣམས་ལ་ནི་མགུལ་པར་རོ། །བུ་མོ་རྣམས་ལ་ནི་སྟ་ཟུར་ནས་ཏེ། དཔལ་དང་ལྡན་པར་བགྱིད་པ་དང་།
en: If one incants jayā, vijayā, nākulī, gandhanākulī, vāruṇī, abhayapāṇi, indrapāṇi, mahaleb cherry, tagara, cakrā, mahācakrā, viṣṇukrāntā, somarājī, or sunandā one hundred and eight times, makes it into a pill, wears it tied onto one’s head or arm, or ties it around a child’s neck or a woman’s waist, it will bring prosperity and pacify bad luck.

source: བཀྲ་མི་ཤིས་པ་རབ་ཏུ་ཞི་བར་བགྱིད་པའི་ནོར་བུ་འདི་བསྲེལ་ན་ཐམས་ཅད་ལས་བསྲུང་བ་བགྱིས་པར་འགྱུར་རོ།
en: With the pill tied on, one becomes protected in every way.

source: །དུག་དང་མེས་མི་ཚུགས་ལགས་སོ། །དུག་གིས་གནོད་པ་བསྐྱེད་པར་མི་འགྱུར་རོ།
en: One will not meet with fire or poison and will not be poisoned.

source: །སྐྱེས་ན་ཡང་གནོད་པ་བསྐྱེད་པར་མི་བགྱིད་ཅིང་། མྱུར་དུ་ཞི་བར་འགྱུར་རོ།
en: If one is, it will not cause any distress and will soon go away.

source: །གདོན་རྣམས་ཞི་བར་འགྱུར་རོ། །རླུང་དང་འབྲུག་དང་སེར་བ་གཅད་པ་དང་། ཆབ་ཀྱི་རྒྱུན་དང་། སེར་བ་བཟློག་པ་ལ་ནི་ཤིང་ཀ་ར་བཱི་རའི་ལྕུག་མས་ཏེ།
en: Using an incanted vine of araṇī, one can pacify grahas and arrest winds, hailstorms, and flooding.

source: ལས་ཐམས་ཅད་བགྱིད་པ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོ་གྲུབ་པ་དམ་པ་མ་བསྒྲུབས་པར་ལས་འདི་རྣམས་བགྱིད་པར་འགྱུར་ལགས་སོ།
en: This heart mantra of Noble Avalokiteśvara can do anything, including producing the supreme accomplishment. If it is mastered, it can certainly accomplish these acts. “

source: །དེ་ནས་བསྒྲུབ་པར་འཚལ་ན་ཐང་སྐུའི་ཆོ་ག་ནི་རས་ལ་ལྷག་མ་མ་ཡིན་པའི་ཚོན་རྩིས། སངས་རྒྱས་དང་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་གི་གཟུགས་བརྙན་རལ་པའི་ཐོར་ཚུགས་དང་ཨེ་ན་ཡའི་པགས་པ་དང་། ཕྱུགས་བདག་གི་ཆ་ལུགས་འཆང་བ་དང་། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བྲི་བར་བགྱི་སྟེ།
en: The vidyā holder who wishes to accomplish this heart mantra should follow this procedure: Using uncontaminated paints and a piece of cloth, he should paint Noble Avalokiteśvara in his form of a buddha and wearing the garb of Paśupati that includes a diadem upon his topknotted hair, a tunic of antelope skin, and all the ornaments.

source: རི་མོ་མཁན་གསོ་སྦྱོང་ཅན་འདྲིར་སྩལ་བར་བགྱིའོ།
en: The painting should be done by a painter observing the ritual fast.

source: །དེ་ནས་སྒྲུབ་པ་པོས་སྐུ་གཟུགས་དེའི་སྤྱན་སྔར་བའི་ལྕི་བའི་དཀྱིལ་འཁོར་བགྱིས་ཏེ། མེ་ཏོག་དཀར་པོའི་སིལ་མ་བཀྲམ་ལ། སྤོས་ཀྱིས་བཀང་བའི་སྣོད་བརྒྱད་གཞག་པར་བགྱིའོ།
en: The vidyā holder should then make a maṇḍala in front of it with cow dung, bestrew it with white flowers, and place eight jars filled with eight offerings there.

source: །སྣ་བརྒྱད་པ་འམ་དྲུག་ཅུ་རྩ་བཞི་པ་འམ། གཞན་ཡང་ལྷ་བཤོས་ཤ་དང་། ཁྲག་དང་མ་འདྲེས་པ་བཤམས་ཤིང་དྲངས་ལ།
en: He should also offer a bali made of another sixty-four articles, but without meat or blood.

source: ཨ་ག་རུའི་བདུག་པས་བདུགས་ཏེ། ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ།
en: Burning incense of agarwood, he should recite the vidyā one thousand and eight times.

source: །ཉིན་ཞག་གཅིག་གམ། ཉིན་ཞག་གསུམ་དུ་སྨྱུང་བ་བགྱིས་ནས་ཟས་དཀར་གསུམ་འཚལ་ཏེ། དུས་གསུམ་དུ་ཁྲུས་བགྱིས་ནས། གོས་གཙང་མ་བགོས་ན།
en: He should fast for one day and night, or for three days, eat three white things, bathe three times a day, and wear clean clothes.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བདག་ཉིད་མཆིས་ནས། བསམས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིད་དོ།
en: Avalokiteśvara will then arrive in person and fulfill every wish. “

source: །ལྡང་རོས་སམ་མིག་སྨན་ལ་བཟླས་བརྗོད་བགྱིས་ཏེ། མིག་ལ་བསྐུས་ན་དེ་ནས་མི་གདའ་བར་གྱུར་ནས་ནམ་མཁའ་ལ་མཆི་བར་འགྱུར་ཞིང་དོན་ཡོད་པའི་ཡེ་ཤེས་བཀོད་པ་ཐམས་ཅད་ཞེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་འཐོབ་པར་འགྱུར་ཏེ།
en: If he incants realgar or collyrium and anoints his eyes with the paste, he will become invisible, will be able to travel through space, and will attain the samādhi called the display of unfailing knowledge.

source: ཅི་འཚལ་བ་དེ་བགྱིད་པར་འགྱུར་རོ། །དེ་ནས་འགྲུབ་པའོ།
en: He will then act as he pleases and accomplish whatever he does.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་།
en: So spoke the Blessed Lord, the noble bodhisattva Avalokiteśvara, his mind transported with joy.

source: གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོའི་ལྷའི་བུ་རྣམས་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: The gods of the Pure Abode, such as the great lord Brahmā Sahāmpati, rejoiced at his words.

source: །དོན་ཡོད་པའི་ཞགས་པ་རྫོགས་སོ།། །།དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་རབ་འབྱམ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Thus concludes the “Amoghapāśa.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། ཉི་མའི་འོད་ལྟར་འོད་ཟེར་སྟོང་འཕྲོ་ཞིང་། འོད་ཟེར་སྣ་ཚོགས་པ་འགྱེད་པའི་ལུས་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། ཞལ་གྱི་དཀྱིལ་འཁོར་རྒྱས་ཤིང་རྫོགས་ལ་ཞི་བ།
en: Part 2 Noble Avalokiteśvara, the great bodhisattva being, rose from his seat, draped his upper garment over one shoulder, knelt with his right knee on the ground, and bowed with folded hands in the direction of the Blessed One, whose body blazed with thousands of light rays of different colors, bright as the sun.

source: བཞིན་འཛུམ་པའི་བཞིན་གྱིས་བྱམས་པ་དང་། སྙིང་རྗེ་ཆེན་པོའི་མཐུ་ཡིད་ལ་བྱེད་པས། རིགས་བཞིའི་འཇིག་རྟེན་ལ་ཕན་པ་དང་། སྙིང་བརྩེ་བས་དོན་ཐམས་ཅད་གྲུབ་པར་རིག་སྔགས་འཆང་རྣམས་ཀྱི་བླ་ན་མེད་པའི་དེ་ཁོ་ན་ཉིད་གྲུབ་པ་མཆོག་སྦྱིན་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He smiled, his face resembling the orb of the full moon, and, reflecting on the power of loving kindness and compassion, he addressed the Blessed One for the benefit of and to show compassion to the members of the four castes and for the sake of obtaining all the supreme accomplishments of vidyā holders, such as the accomplishments of the true nature, and obtaining the boons that these accomplishments bestow. “

source: །བཅོམ་ལྡན་འདས་བདག་ལ་དོན་ཡོད་པའི་རྒྱལ་པོའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཆེན་པོའི་སྙིང་པོ་འདི་མཆིས་ཏེ། འདི་པདྨ་རྒྱ་ཆེན་པོའི་དཀྱིལ་འཁོར་དེ་ཁོ་ན་ཉིད་ཆེན་པོའི་སྙིང་པོར་འཕགས་པ་སྙིང་པོར་གྱུར་པ།
en: This Amogharāja, O Blessed One, is the quintessence of my sovereign ritual.

source: དེ་ཁོ་ན་ཉིད་གྲུབ་པ་པདྨ་དམ་པ་དཀྱིལ་འཁོར་ཆེན་པོ་འདི་ཕྱག་རྒྱ་དང་། གསང་སྔགས་དང་། སྙིང་པོ་རིམ་པར་ཕྱེ་བ་གསང་བ་དམ་པ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་དམ་ཚིག་དང་། སྒྲུབ་པ་གསང་བ་འདི།
en: In it, there is a very secret, quintessential part that teaches the secret samaya practice of the great maṇḍalas, mudrās, and mantras that together constitute an ultimate maṇḍala of liberation. It brings the realization of reality that arises out of the great essence of reality itself by the means of the great lotus maṇḍala.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བསྒྲག་པར་བགྱིའོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་མང་པོའི་འཁོར་ཆེན་པོའི་མདུན་དང་།
en: I will now proclaim these teachings before the Blessed One. “

source: རིག་སྔགས་གྲུབ་པའི་ལྷའི་དཀྱིལ་འཁོར་གྱི་མདུན་འདིར་ཡང་བསྒྲག་པར་བགྱིའོ། །གང་ཡང་དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ཚངས་པ་དང་། ལྷ་དང་གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་དང་།
en: I will proclaim these teachings here, in the midst of this great assembly, before the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, and before the circle of the accomplished vidyā deities.

source: དྲང་སྲོང་གི་ཚོགས་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། སྐར་མའི་ཚོགས་དང་རྒྱུ་སྐར་དང་། རིག་སྔགས་འཆང་གྲུབ་པའི་ལྷ་མོ་རྣམས་ཀྱི་མདུན་དུ་དེ་ཁོ་ན་ཉིད་ཀྱི་སྙིང་པོ་ཡང་དག་པ་འཇིག་རྟེན་ལས་འདས་པ།
en: I will proclaim them before the deities such as Īśvara, Maheśvara, and Brahmā, before Yama, Varuṇa, Kubera, the hosts of ṛṣis, Candra, Sūrya, stars and stellar constellations, siddhas, and celestial vidyādharīs.

source: དངོས་གྲུབ་སྒྲུབ་པ་བཀླགས་པས་གྲུབ་པ་དང་།
en: I will proclaim them before the Blessed One, who embodies the transcendent accomplishment of the true essence of reality that is won through the successful practice of recitation and visualization.

source: བསྒོམས་པས་གྲུབ་པ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རིག་སྔགས་ཆེན་པོ་འཆང་བའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བའི་མདུན་དུ་དེ་ཁོ་ན་ཉིད་ཀྱི་སྙིང་པོ་གསང་བ་དམ་པ་བསྒྲགས་ཤིང་བརྗོད་པར་བགྱིའོ།
en: I will proclaim them before the retinue-hosts of the great vidyādharas. I will teach the supreme secret of the essence of reality.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་བསོད་ནམས་སྟོང་གིས་བརྒྱན་པ་མཚན་དང་དཔེ་བྱད་རྣམས་ཀྱིས་རྣམ་པར་སྤྲས་པ། ཕྱག་དཔུང་པའི་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་འོད་ཟེར་འཕྲོ་བ་དུ་མའི་ཕྲེང་བ་དང་། སྤོས་ཀྱི་གླང་པོ་ཆེའི་སྣ་ལྟ་བུའི་ཕྱག་བརྐྱང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱི་བོར་བཞག་ནས་ཀླད་པ་ལ་བྱུགས་ཏེ། འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སེམས་ཅན་དག་པ་དམ་པ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་སྨྲོས་ཤིག །
en: The blessed Tathāgata Śākyamuni, adorned with hundreds of thousands of merits and splendorous with the major and minor marks of perfection, extended his golden arm, which was fragrant like a rutting elephant and haloed with many light rays, placed his hand on the head of Noble Avalokiteśvara, the great bodhisattva being, and stroked him, saying, “Please speak, O great compassionate, supremely pure being!

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཏེ།
en: You are blessed by the tathāgatas, and now also by me.

source: ངས་ཀྱང་ད་ལྟར་བྱིན་གྱིས་རློབ་ཀྱིས་ཁྱོད་གསང་བ་དམ་པའི་དམ་ཚིག་སྨྲོས་ཤིག །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རྗེས་སུ་ཡི་རང་ཞིང་བྱིན་གྱིས་བརླབས་པ་གང་གཱའི་ཀླུང་འབུམ་ཕྲག་བྱེ་བ་བརྒྱ་སྟོང་གི་བྱེ་མའི་རྡུལ་ཕྲ་རབ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཀྱང་བྱིན་གྱིས་བརླབས་ཤིང་རྗེས་སུ་ཡི་རང་བར་མཛད་དོ།
en: Teach the most secret samaya that is delighted in and blessed by all the tathāgatas in the ten directions as numerous as atoms in the universe or the hundreds of thousands of millions of billions of sand grains in the Gaṅgā river. They rejoice and cheer you on.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཕྱོགས་བཅུར་བལྟས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རང་གི་སྙིང་པོ་དེ་ཁོ་ན་ཉིད་གསང་བའི་གསང་སྔགས་འདི་དག་གསོལ་ཏོ།
en: Blessed Avalokiteśvara, the great bodhisattva being, looked in the ten directions, and then, facing the Blessed One, spoke the following mantras that are his own secret reality and essence: [2] “Oṁ, you with a lotus in your hand, great Amoghapāśa, activate the essence of samaya!

source: །ཨོཾ་པདྨ་ཧ་སྟ།
en: Go ahead, do!

source: མ་ཧཱ་ཨ་མོ་གྷ་པཱ་ཤ་སཱ་དྷ་ཡ་ས་མ་ཡ་ཧྲི་ད་ཡན་ཙ་ར་ཙ་ར་ཧཱུཾ།
en: Hūṁ!”

source: དོན་ཡོད་པའི་ཞགས་པའི་རང་བཞིན་གྱི་གཟུངས་ཀྱི་སྙིང་པོ་ཡིན་ནོ།
en: This mantra is the essence and innate nature of Amoghapāśa; it is a secret heart mantra of Noble Avalokiteśvara, the great bodhisattva being.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསང་བའི་སྙིང་པོ་འདི་བརྗོད་མ་ཐག་ཏུ་རིའི་རྒྱལ་པོ་པོ་ཏ་ལ་འདི་བྲག་དང་། ནགས་ཚལ་དང་། རྩི་ཤིང་དུ་བཅས་པ་དང་། རི་རབ་ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་དང་བཅས་པ་རྣམས་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་ཤིང་ལྷའི་གནས་རྣམས་ཀྱང་ལྡེག་པར་གྱུར་ཏེ།
en: As soon as it was spoken, Potala, the king of mountains, quaked in six different ways, along with all the mountains, forests, and groves, including Mount Sumeru with its inner and outer encircling ranges.

source: ཐམས་ཅད་འདར་འདར་པོར་གྱུར་ཏོ། །ཀླུའི་གནས་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོའི་གནས་རྣམས་ཀྱང་འཁྲུག་པར་གྱུར་ཏོ།
en: All the palaces of gods swayed, as did the dwellings of nāgas, yakṣas, and rākṣasas.

source: །རྒྱ་མཚོ་ཆེན་པོའི་རླབས་ཀྱང་འཁྲུག་པར་གྱུར་ཏོ། །ཆུ་གཏེར་རྣམས་ཀྱང་འཁྲུག་པར་གྱུར་ཏོ།
en: The great oceans swelled with waves, and the bodies of water shook.

source: །དེ་མ་ཐག་ཏུ་ཕྱོགས་བཅུ་ན་སངས་རྒྱས་ཀྱི་སྐུ་གཟུགས་བརྙན་བཞུགས་པ་རྣམས་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། འདི་སྐད་ཅེས་ཀྱང་བཀའ་སྩལ་ཏོ།
en: The buddhas throughout the ten directions applauded: “Good!

source: །རྒྱལ་བའི་བདག་ཉིད་དུ་སྐྱེས་པ་དོན་ཡོད་པའི་ཞགས་པའི་གསང་བའི་སྙིང་པོ་བཀླགས་པས་འགྲུབ་པ་བླ་ན་མེད་པ་སྨྲས་པ་ལེགས་སོ་ལེགས་སོ།
en: Good it is, O son of the victors! The secret heart mantra of Amogha was beautifully presented. If it is recited, it will bring supreme accomplishments.”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The blessed Tathāgata Śākyamuni said, “Good! Good it is, Avalokiteśvara!

source: །སེམས་པ་དག་པ་ཁྱོད་ཀྱིས་གསང་བ་བཀླག་པའི་ཆོ་ག་དེ་ཁོ་ན་ཉིད་སྒྲུབ་པ་རྒྱས་པ་དང་བཅས་པར་སྨྲོས་ཤིག །
en: When recited, this secret amogha mantra will bring the realization of reality.”

source: སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསོལ་པ།
en: Avalokiteśvara replied, “It is so, O Blessed One!

source: བཅོམ་ལྡན་འདས་གསང་བའི་སྙིང་པོའི་གཟུངས་འདི་ལན་ཅིག་བརྗོད་པ་ཙམ་གྱིས་དེའི་མོད་ལ་ཕྱོགས་བཅུ་ཐ་དད་པ་ནས་གང་གཱའི་ཀླུངས་ཡ་བྱེ་བ་བརྒྱ་སྟོང་གི་བྱེ་མ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཕྱག་བརྐྱང་སྟེ།
en: This secret heart dhāraṇī, even if it is repeated just once, will cause each and every single tathāgata everywhere in the ten directions, equal in number to millions of billions times the number of sand particles in the Gaṅgā river, to extend his arm and hold the reciter’s head, giving him comfort. The reciter will perceive every tathāgata.

source: སྤྱི་བོར་བཞག་ནས་ལེགས་སོ་ཞེས་བགྱི་བའི་སྒྲ་གསུངས་ཏེ། གསུངས་པ་ཙམ་གྱི་མོད་ལ་སྔོན་བསྐལ་བ་བརྒྱ་སྟོང་དུ་བསགས་པའི་སྒྲིབ་པ་རྣམས་ཉམས་པར་བགྱིད།
en: By merely pronouncing this mantra, he will be freed from disease for hundreds of thousands of eons.

source: ཞིག་པར་བགྱིད་དོ། །སྡིག་པ་ཐམས་ཅད་དང་།
en: Hells will no longer exist for him, and his wrongdoings will be purified.

source: ནད་ཐམས་ཅད་དང་། དེ་བཞིན་དུ་གནོད་པ་ཞི་བར་བགྱིད་དོ། །སྡིག་པ་དང་སེམས་ཅན་གདུག་པ་རྣམས་དང་།
en: All his diseases and ailments will cease, as will all wickedness.

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་དང་། མི་མཛའ་བ་རྣམས་འཇིག་པར་བགྱིད་དེ། འདི་ལ་ཐེ་ཚོམ་མི་བགྱིའོ།
en: Wicked beings, enemies, and adversaries will perish; there is no doubt about this.

source: །རྟག་ཏུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མཆོག་སྦྱིན་བལྟ་འཚལ་བར་འགྱུར་ལགས་སོ།
en: Noble Avalokiteśvara will grant him boons and appear to him continually. “

source: །རིག་སྔགས་འདིའི་ཆོ་ག་སྒྲུབ་པ་ནི་འདི་ཡིན་ཏེ།
en: For this vidyā, there is the following worship procedure and the samaya of conduct. “

source: རིག་སྔགས་འཆང་གཙང་མར་གྱུར་པས་ཤིན་ཏུ་ཁྲུས་བགྱིས་ཏེ། གོས་གཙང་མ་བགོས་པར་བགྱིའོ།
en: The vidyā holder should purify himself, bathe thoroughly, and put on clean clothes.

source: །བྱམས་པ་དང་། སྙིང་རྗེ་ཡིད་ལ་བགྱིས་པས་འབྱུང་པོ་ཐམས་ཅད་ལ་མཆོག་ཏུ་སྙིང་བརྩེ་བར་བགྱིའོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ལ་མཆོད་པར་བགྱིའོ། །མེ་ཏོག་དང་། བདུག་པ་དང་།
en: He should give rise to loving kindness and compassion and be solely motivated by kindness for all beings.

source: དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། མར་མེ་དབུལ་བར་བགྱིའོ། །ཚེས་བརྒྱད་དམ།
en: He should make offerings before a cloth painting of Noble Avalokiteśvara, with flowers, incense, perfume, garlands, scented oils, and lamps, on either the eighth or the fifteenth day of the bright fortnight.

source: ཚེས་བཅྭ་ལྔ་ལ་སྒྲུབ་པའི་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་བགྱིའོ། །རི་མོའི་གཟུགས་ཀྱི་མདུན་དུ་ཐོག་མར་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ། །ཚིག་གཞན་མི་སྨྲ་བར་ཁྲོ་བོའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ་ཆབ་དང་། ཡུངས་ཀར་གྱིས་དབང་བསྐུར་བར་བགྱིའོ།
en: The recitation procedure requires the vidyā holder to recite the heart mantra of Amoghapāśa one hundred and eight times while sitting in a cross-legged posture in front of the painting and refraining from other talk.

source: །ཕྱག་རྒྱ་བཅིང་བར་བགྱི་སྟེ། ལན་ཉི་ཤུ་རྩ་གཅིག་གདོན་པར་བགྱིའོ།
en: He should then recite the mantra of Krodharāja one hundred and eight times, while sprinkling the painting with water and mustard seeds and forming his mudrā twenty-one times in succession.

source: །གསང་སྔགས་ཀྱིས་ནི་དབང་བསྐུར་བར་བགྱིའོ།
en: One thus performs the mantra and mudrā empowerments of the painting. “

source: །ཕྱག་རྒྱས་ཀྱང་དབང་བསྐུར་བར་བགྱིའོ། །དེའི་འོག་ཏུ་དོན་ཡོད་པའི་ཞགས་པའི་གསང་བའི་དམ་ཚིག་གི་སྙིང་པོ་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ།
en: After that, he should recite the heart mantra of the secret amogha samaya one thousand and eight times.

source: །བཟླས་བརྗོད་བཏོན་པ་ཙམ་གྱིས་དེའི་མོད་ལ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ཁྲོ་བོའི་རྒྱལ་པོ་དང་བཅས་པ་འབུམ་འགྱུར་དུ་བཟླས་བརྗོད་བགྱིས་པར་འགྱུར་རོ།
en: When this mantra is thus repeated one hundred thousand times together with the heart mantra of Amoghapāśa and the mantra of Krodharāja, the recitation procedure is complete.

source: །བཟླས་བརྗོད་རྫོགས་ནས་རི་མོའི་གཟུགས་འབར་ཞིང་ས་ཡང་གཡོ་བར་འགྱུར་རོ།
en: Upon its completion, the cloth painting will blaze with light and the earth will quake.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ལུས་ལས་འོད་ཟེར་སྣ་ཚོགས་པ་འབྱུང་བར་འགྱུར་རོ།
en: Light rays of various colors will radiate from the body of Noble Avalokiteśvara.

source: །དོན་ཡོད་པའི་ཞགས་པ་ལག་ན་ཐོགས་པའི་ཞགས་པ་འབར་བར་འགྱུར་ཞིང་།
en: The noose held in Amoghapāśa’s hand will also blaze with light.

source: རིག་སྔགས་འཆང་སྙིང་དགའ་བ་དང་། སྤྱི་བོའི་གཙུག་འབར་བར་འགྱུར་རོ།
en: The vidyā holder will be thrilled, his body hair will bristle, and the top of his head will emit light.

source: །འདི་ནི་གྲུབ་པའི་རྟགས་ཡིན་ནོ་ཞེས་གྲུབ་པའི་རྟགས་དང་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་ཏེ། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོའི་ཕྱག་རྒྱ་འགྲུབ་པར་འགྱུར་རོ།
en: This is the sign of success—the ritual seal of the heart mantra of Amoghapāśa has been accomplished. “

source: །དེ་ནས་དགོས་པ་ཐམས་ཅད་དང་ལས་ཐམས་ཅད་བརྗོད་པ་ཙམ་གྱིས་དེའི་མོད་ལ་འགྲུབ་པར་འགྱུར་ལགས་སོ།
en: Subsequently, all activities and all tasks will be accomplished by merely pronouncing the mantra.

source: །དེ་བཞིན་གཤེགས་པ་ས་ཡ་བྱེ་བ་བརྒྱ་སྟོང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་མཉམ་པའི་ཕྱག་གསེར་གྱི་ཁ་དོག་འདྲ་བས་སྤྱི་བོའི་གཙུག་ཏུ་འཇོག་པར་རྨི་ལམ་དུ་མཐོང་བར་འགྱུར་རོ།
en: Hundreds of thousands of millions of billions of tathāgatas, as numerous as the grains of sand in the Gaṅgā river, will simultaneously appear before the vidyā holder and place their golden hand on his head.
